Revit 2024 API
BuiltInFailures.LoadFailures.LineLoadAllZero Property
 Line Load can't have all force components and moment components to be zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LineLoadAllZero { get; }
Visual Basic
Public Shared ReadOnly Property LineLoadAllZero As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LineLoadAllZero {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace